{
    "fullName": "Viberth Eduardo Gonzalez",
    "emailUser": "Crucior",
    "emailDomain": "outlook.com",
    "phone": "+506 83209884",
    "location": "Alajuela, AJ",
    "linkText": "Linkedin",
    "linkUrl": "[https://www.linkedin.com/in/vibertheduardo/](https://www.linkedin.com/in/vibertheduardo/)",
    "skillsSectionTitle": "TECHNICAL SKILLS",
    "educationSectionTitle": "EDUCATION",
    "experience": [
        {
            "position": "Senior Frontend & Automation Engineer",
            "duration": "2022 - Present",
            "responsibilities": [
                "Built and maintained frontend interfaces using React and modern JavaScript (ES6+), focusing on reusable components and clean architecture.",
                "Integrated frontend applications with RESTful APIs to support internal platforms and automation-driven systems.",
                "Developed responsive UI layouts using HTML5, CSS3, and utility-first styling approaches aligned with Tailwind/Bootstrap principles.",
                "Collaborated with backend engineers and stakeholders to translate business requirements into scalable UI solutions.",
                "Optimized frontend performance and reliability by refactoring components and improving client-side logic.",
                "Applied Git-based workflows and participated in code reviews to ensure code quality and secure development practices."
            ]
        },
        {
            "position": "QA Automation & Frontend Support Engineer",
            "duration": "2020 - 2022",
            "responsibilities": [
                "Automated UI and functional test scenarios using JavaScript-based testing tools and browser automation frameworks.",
                "Validated frontend behavior, usability, and responsiveness across different environments and browsers.",
                "Worked closely with developers to troubleshoot UI defects and improve overall user experience.",
                "Integrated automated tests into development workflows to support regression testing and release stability.",
                "Reviewed frontend changes for accessibility, UI consistency, and adherence to best practices.",
                "Supported agile teams by providing fast feedback on UI quality and application behavior."
            ]
        }
    ],
    "education": [
        {
            "institution": "Cenfotec",
            "degree": "Software Engenier",
            "date": "",
            "description": "Formal education in software engineering with emphasis on web development, programming fundamentals, and engineering best practices, including frontend architectures and application development projects."
        }
    ],
    "skills": [
        {
            "title": "JavaScript (ES6+)",
            "description": "Strong experience developing frontend logic using modern JavaScript features for scalable and maintainable web applications."
        },
        {
            "title": "React",
            "description": "Building component-based user interfaces, managing state, and integrating frontend applications with RESTful services."
        },
        {
            "title": "Responsive UI Development",
            "description": "Designing responsive interfaces using HTML5, CSS3, and CSS frameworks such as Tailwind CSS and Bootstrap."
        },
        {
            "title": "REST API Integration",
            "description": "Consuming and integrating RESTful APIs within frontend applications to enable dynamic data-driven UIs."
        },
        {
            "title": "Frontend Testing & QA",
            "description": "Experience with automated testing concepts, unit and integration testing, and UI validation to ensure application quality and reliability."
        }
    ],
    "fontFamily": "Helvetica",
    "fontSizes": {
        "contact": 0.9,
        "educationDate": 0.85,
        "educationDegree": 0.95,
        "educationDescription": 0.9,
        "educationInstitution": 0.95,
        "experienceBullet": 0.9,
        "experienceCompany": 1,
        "experienceDuration": 0.9,
        "experiencePosition": 0.95,
        "name": 2.4,
        "sectionTitle": 1.15,
        "skillsContent": 0.9
    }
}